clc;
clear all; %#ok<CLALL>
close all;
%%
X=1:1:127;
for NCellId=0:1:1007
    testing=SssGenerator.generateSssByCellInfo(NCellId);
    reference=nrSSS(NCellId).';
    if any(testing~=reference)
        figure;
        stem(X(testing~=reference),testing(testing~=reference));
        throw(MException('abrakadabra',"Error in the SssGenerator module"));
    end
end
disp("It is working... Wow");
%%
testing=SssGenerator.generateSssByCellInfo(17); 
%%
figure
corr=xcorr(testing);
plot(-126:1:126,corr);
title("Красивый график для N^{CELL}_{ID} = 17");
xlabel("Отсчеты");
ylabel("Автокорреляция");
grid;




























%% P.S.
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
% ИНДЕКСАЦИЯ С 1
